/* About screen blog label */
"About.blog" = "Blog";

/* About screen footer */
"About.footer" = "Készítette: DigiWallet globális csapata. Verzió: %1$@";

/* Privay Policy button label */
"About.privacy" = "Adatvédelmi irányelvek";

/* About screen reddit label */
"About.reddit" = "Reddit";

/* Terms of Use button label */
"About.terms" = "Felhasználási feltételek";

/* About screen title */
"About.title" = "Névjegy";

/* About screen twitter label */
"About.twitter" = "Twitter";

/* Close modal button accessibility label */
"AccessibilityLabels.close" = "Bezár";

/* Support center accessibiliy label */
"AccessibilityLabels.faq" = "Támogatási Központ";

/* Loading Wallet Message */
"Account.loadingMessage" = "Pénztárca betöltése";

/* Default wallet name */
"AccountHeader.defaultWalletName" = "DigiWalletem";

/* Error alert title */
"Alert.error" = "Hiba";

/* No internet alert message */
"Alert.noInternet" = "Nem található internet kapcsolat. Kérlek ellenőrizd a kapcsolatod és próbáld meg újra.";

/* Warning alert title */
"Alert.warning" = "Figyelmeztetés";

/* 'the addresses were copied'' Alert title */
"Alerts.copiedAddressesHeader" = "Címek másolva";

/* Addresses Copied Alert sub header */
"Alerts.copiedAddressesSubheader" = "Az összes pénztárca cím sikeresen másolva.";

/* Alert Header Label (the paper key was set) */
"Alerts.paperKeySet" = "Papír kulcs beállítás";

/* Alert Subheader label (playfully positive) */
"Alerts.paperKeySetSubheader" = "Fantasztikus!";

/* Alert Header label (the PIN was set) */
"Alerts.pinSet" = "PIN kód beállítás";

/* Send failure alert header label (the send failed to happen) */
"Alerts.sendFailure" = "A küldés nem sikerült";

/* Send success alert header label (confirmation that the send happened) */
"Alerts.sendSuccess" = "Megerősítés küldése";

/* Send success alert subheader label (e.g. the money was sent) */
"Alerts.sendSuccessSubheader" = "Pénz elküldve!";

/* JSON Serialization error message */
"ApiClient.jsonError" = "JSON Sorszámozási hiba";

/* Wallet not ready error message */
"ApiClient.notReady" = "Pénztárca nem áll készen";

/* API Token error message */
"ApiClient.tokenError" = "API token lekérése nem lehetséges";

/* Send BCH view body. */
"BCH.body" = "Adj meg egy cél DigiByte címet alul. A fork idején (%1$@) a pénztárcádban található összes DigiByte  küldésre kerül.";

/* Confirm sending <$5.00> to <address>? */
"BCH.confirmationMessage" = "Küldés megerősítése: %1$@, %2$@ számára.";

/* Confirmation alert title */
"BCH.confirmationTitle" = "Megerősítés";

/* Generic bch erorr message */
"BCH.genericError" = "A számlád nem tartalmaz DigiByte-ot, vagy a fork után kaptad meg.";

/* Transaction ID copied message */
"BCH.hashCopiedMessage" = "Tranzakciós ID másolva";

/* No address error message */
"BCH.noAddressError" = "Kérlek adj meg egy címet";

/* Attempted to scan unsupported qr code error message. */
"BCH.paymentProtocolError" = "Fizetési protokollkérelmek nem támogatottak a DigiByte tranzakciókhoz";

/* BCH successfully sent alert message */
"BCH.successMessage" = "DigiByte sikeresen elküldve.";

/* Widthdraw BCH view title */
"BCH.title" = "DigiByte kiutalás";

/* Tx Hash button header */
"BCH.txHashHeader" = "DigiByte tranzakciós ID";

/* Approve button label */
"BitID.approve" = "Jóváhagy";

/* <sitename> is requesting authentication using your bitcoin wallet */
"BitID.authenticationRequest" = "%1$@ hitelesítést kér a DigiByte pénztárcád használatához";

/* Deny button label */
"BitID.deny" = "Megtagadás";

/* BitID error alert title */
"BitID.error" = "Hitelesítési hiba";

/* BitID error alert messaage (The payment service you are trying to use isn't working. Please contact them, as you may need to try again) */
"BitID.errorMessage" = "Kérjük, ellenőrizd a szolgáltatást. Lehet, hogy újra kell próbálkoznod.";

/* BitID success alert title */
"BitID.success" = "Sikeres hitelesítés";

/* BitID Authentication Request alert view title */
"BitID.title" = "DigiID Hitelesítési kérelem";

/* Cancel button label */
"Button.cancel" = "Mégsem";

/* Ignore button label */
"Button.ignore" = "Mellőz";

/* menu button */
"Button.menu" = "menü";

/* No button */
"Button.no" = "Nem";

/* OK button label */
"Button.ok" = "Ok";

/* receive button */
"Button.receive" = "kap";

/* send button */
"Button.send" = "Küldés";

/* Settings button label */
"Button.settings" = "Beállítások";

/* Settings button label */
"Button.submit" = "Elfogad";

/* Yes button */
"Button.yes" = "Igen";

/* Camera plugin instruction */
"CameraPlugin.centerInstruction" = "Pozicionáld középre az igazolványt a dobozban";

/* Amount to Send: ($1.00) */
"Confirmation.amountLabel" = "Küldendő összeg:";

/* Network Fee: ($1.00) */
"Confirmation.feeLabel" = "Hálózati költség:";

/* eg. Processing time: This transaction will take 10-30 minutes to process. */
"Confirmation.processingTime" = "Feldolgozási idő:  A tranzakció  %1$@ másodpercet vesz igénybe a feldolgozáshoz.";

/* Label for "send" button on final confirmation screen */
"Confirmation.send" = "Küldés";

/* Confirmation Screen title */
"Confirmation.title" = "Megerősítés";

/* To: (address) */
"Confirmation.to" = "Számára";

/* Total Cost: ($5.00) */
"Confirmation.totalLabel" = "Összesen:";

/* Confirm paper phrase view label. */
"ConfirmPaperPhrase.label" = "Annak érdekében, hogy minden helyesen lett-e leírva, kérlek írd be a következő szavakat a papír kulcsodról.";

/* Word label eg. Word #1, Word #2 */
"ConfirmPaperPhrase.word" = "Szó #%1$@";

/* Bitcoin denomination picker label */
"DefaultCurrency.bitcoinLabel" = "DigiByte Kijelző Egység";

/* Exchange rate label */
"DefaultCurrency.rateLabel" = "Árfolyam";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableMessage" = "Ez az eszköz nincs konfigurálva, hogy e-mailt tudjon küldeni az iOS levelező alkalmazással.";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableTitle" = "Email nem elérhető";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableMessage" = "Ez az eszköz nincs konfigurálva üzenetek küldésére.";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableTitle" = "Az üzenetek nem elérhetőek";

/* You can customize your Face ID Spending Limit from the [FaceIdSettings.linkText gets added here as a button] */
"FaceIDSettings.customizeText" = "Testreszabhatod a Face ID költési limitét innen: %1$@.";

/* Face Id screen label */
"FaceIDSettings.label" = "Használd az arcodat a DigiWallet feloldásához, és küldj pénzt egy meghatározott határértékig.";

/* Link Text (see FaceIdSettings.customizeText) */
"FaceIDSettings.linkText" = "Link szöveg (lásd TouchIdSettings.customizeText)";

/* Face id switch label. */
"FaceIDSettings.switchLabel" = "Face ID engedélyezése a DigiWallet számára";

/* Face ID settings view title */
"FaceIDSettings.title" = "Face ID";

/* Face ID unavailable alert message */
"FaceIDSettings.unavailableAlertMessage" = "Nem állítottál be Face ID-t ezen az eszközön. Menj a Beállítások -> Face ID és jelszavak lehetőségre és állítsd be most.";

/* Face ID unavailable alert title */
"FaceIDSettings.unavailableAlertTitle" = "Face ID nincs beállítva";

/* Face Id spending limit screen title */
"FaceIDSpendingLimit.title" = "Face ID költési limit";

/* Economy fee */
"FeeSelector.economy" = "Gazdaság";

/* Fee Selector economly fee description */
"FeeSelector.economyLabel" = "Becsült kézbesítés: 10+ perc";

/* Warning message for economy fee */
"FeeSelector.economyWarning" = "Ez az opció nem ajánlott az időérzékeny tranzakciókhoz.";

/* Regular fee */
"FeeSelector.regular" = "Szokásos";

/* Fee Selector regular fee description */
"FeeSelector.regularLabel" = "Becsült kézbesítés: 15-30 másodperc";

/* Fee Selector title */
"FeeSelector.title" = "Feldolgozási sebesség";

/* Checking private key balance progress view text */
"Import.checking" = "Privát kulcs egyenleg ellenőrzése...";

/* Sweep private key confirmation message */
"Import.confirm" = "Küldés %1$@ privát kulcsról a pénztárcába? DigiByte hálózati költség: %2$@.";

/* Duplicate key error message */
"Import.Error.duplicate" = "Ez a privát kulcs már használatban van.";

/* empty private key error message */
"Import.Error.empty" = "Ez a privát kulcs üres.";

/* High fees error message */
"Import.Error.highFees" = "A tranzakciós költségek többe kerülnének, mint a privát kulcson rendelkezésre álló összeg.";

/* Not a valid private key error message */
"Import.Error.notValid" = "Érvénytelen privát kulcs";

/* Import signing error message */
"Import.Error.signing" = "Hiba történt a tranzakció aláírásakor";

/* Import button label */
"Import.importButton" = "Importálás";

/* Importing wallet progress view label */
"Import.importing" = "Pénztárca importálása";

/* Caption for graphics */
"Import.leftCaption" = "Importálható pénztárca";

/* Import wallet intro screen message */
"Import.message" = "A pénztárca importálás egyetlen tranzakcióval átutalja az összes pénzt a pénztárcából a DigiWalletbe.";

/* Enter password alert view title */
"Import.password" = "Ez a privát kulcs jelszóval védett.";

/* password textfield placeholder */
"Import.passwordPlaceholder" = "jelszó";

/* Caption for graphics */
"Import.rightCaption" = "DigiWalleted";

/* Scan Private key button label */
"Import.scan" = "Privát kulcs beolvasása";

/* Import wallet success alert title */
"Import.success" = "Siker";

/* Successfully imported wallet message body */
"Import.SuccessBody" = "Sikeresen importált pénztárca.";

/* Import Wallet screen title */
"Import.title" = "Pénztárca importálása";

/* Unlocking Private key activity view message. */
"Import.unlockingActivity" = "Kulcs feloldása";

/* Import wallet intro warning message */
"Import.warning" = "Pénztárca importálása nem tartalmazza a tranzakciós előzményeket vagy más egyéb részletet.";

/* Wrong password alert message */
"Import.wrongPassword" = "Helytelen jelszó, kérlek próbáld újra.";

/* Close app button */
"JailbreakWarnings.close" = "Bezár";

/* Ignore jailbreak warning button */
"JailbreakWarnings.ignore" = "Mellőz";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithBalance" = "A  KÉSZÜLÉK BIZTONSÁGA VESZÉLYEZTETETT\nMinden 'jailbreak' alkalmazás hozzáférhet a DigiWallet kulcstartó adataihoz és ellophatja DigiByte-jaidat! Töröld ezt a pénztárcát és állítsd helyre egy biztonságos eszközön.";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithoutBalance" = "A  KÉSZÜLÉK BIZTONSÁGA VESZÉLYEZTETETT\nMinden 'jailbreak' alkalmazás hozzáférhet a DigiWallet kulcstartó adataihoz és ellophatja a DigiByte-jaidat. Kérlek csak nem jailbreakelt eszközön használd a DigiWalletet.";

/* Jailbreak warning title */
"JailbreakWarnings.title" = "FIGYELMEZTETÉS";

/* Location services disabled error */
"LocationPlugin.disabled" = "A helyszolgáltatások le vannak tiltva.";

/* No permissions for location services */
"LocationPlugin.notAuthorized" = "A DigiWalletnek nincs engedélye a helymeghatározási szolgáltatások eléréséhez.";

/* Wallet creation date prefix */
"ManageWallet.creationDatePrefix" = "Pénztárca létrehozás időpontja: %1$@";

/* Manage wallet description text */
"ManageWallet.description" = "A pénztárca név csak a fiók tranzakciós előzményeiben jelenik meg és senki más nem fogja látni rajtad kívül.";

/* Change Wallet name textfield label */
"ManageWallet.textFeildLabel" = "Pénztárca név";

/* Manage wallet modal title */
"ManageWallet.title" = "Pénztárca kezelés";

/* Buy bitcoin title */
"MenuButton.buy" = "DigiByte vásárlás";

/* Menu button title */
"MenuButton.lock" = "Pénztárca zárolás";

/* Menu button title */
"MenuButton.security" = "Biztonsági Központ";

/* Menu button title */
"MenuButton.settings" = "Beállítások";

/* Menu button title */
"MenuButton.support" = "Támogatás";

/* button label */
"MenuViewController.createButton" = "Új pénztárca létrehozása";

/* Menu modal title */
"MenuViewController.modalTitle" = "Menü";

/* button label */
"MenuViewController.recoverButton" = "Pénztárca visszaállítása";

/* Switch to automatic mode button label */
"NodeSelector.automaticButton" = "Váltás automata üzemmódra";

/* Node is connected label */
"NodeSelector.connected" = "Kapcsolódva";

/* Enter node ip address view body */
"NodeSelector.enterBody" = "Add meg a csomópont IP címét és portját (választható)";

/* Enter Node ip address view title */
"NodeSelector.enterTitle" = "Csomópont megadása";

/* Switch to manual mode button label */
"NodeSelector.manualButton" = "Váltás manuális üzemmódra";

/* Node address label */
"NodeSelector.nodeLabel" = "Jelenlegi elsődleges csomópont";

/* Node is not connected label */
"NodeSelector.notConnected" = "Nem kapcsolódik";

/* Node status label */
"NodeSelector.statusLabel" = "Csomópont csatlakozás állapota";

/* Node Selector view title */
"NodeSelector.title" = "DigiByte csomópontok";

/* Bad Payment request alert title */
"PaymentProtocol.Errors.badPaymentRequest" = "Rossz fizetési kérelem";

/* Error opening payment protocol file message */
"PaymentProtocol.Errors.corruptedDocument" = "Nem támogatott vagy sérült dokumentum";

/* Missing certificate payment protocol error message */
"PaymentProtocol.Errors.missingCertificate" = "hiányzó tanúsítvány";

/* Request expired payment protocol error message */
"PaymentProtocol.Errors.requestExpired" = "lejárt kérés";

/* Payment too small alert title */
"PaymentProtocol.Errors.smallOutputError" = "Sikertelen fizetés";

/* Amount too small error message */
"PaymentProtocol.Errors.smallPayment" = "DigiByte kifizetés nem lehet kevesebb mint %1$@.";

/* Output too small error message. */
"PaymentProtocol.Errors.smallTransaction" = "DigiByte tranzakciós kimenetek nem lehetnek kevesebbek mint $@.";

/* Unsupported signature type payment protocol error message */
"PaymentProtocol.Errors.unsupportedSignatureType" = "nem támogatott aláírás típus";

/* Untrusted certificate payment protocol error message */
"PaymentProtocol.Errors.untrustedCertificate" = "megbízhatatlan igazolás";

/* Enable face ID prompt body */
"Prompts.FaceId.body" = "Bökj ide a Face ID engedélyezéséhez";

/* Enable face ID prompt title */
"Prompts.FaceId.title" = "Face ID engedélyezése";

/* No passcode set warning body */
"Prompts.NoPasscode.body" = "Eszköz jelszó szükséges a pénztárca védelme érdekében. Menj a beállításokhoz és kapcsold be a jelszavas védelmet.";

/* No Passcode set warning title */
"Prompts.NoPasscode.title" = "Kapcsold be az eszköz jelszavas védelmét";

/* Warning about paper key. */
"Prompts.PaperKey.body" = "A papír kulcsot mindig helyezd biztonságba, hogy meglegyen egy esetleges telefon elvesztés vagy csere esetén. Bökj ide a folytatáshoz.";

/* An action is required (You must do this action). */
"Prompts.PaperKey.title" = "Cselekvés szükséges";

/* Transaction rejected prompt body */
"Prompts.RecommendRescan.body" = "A pénztárcád lehet, hogy nincs szinkronizálva. Ez megoldható a blokklánc újrabeolvasásával.";

/* Transaction rejected prompt title */
"Prompts.RecommendRescan.title" = "Tranzakció elutasítva";

/* Share data prompt body */
"Prompts.ShareData.body" = "Segíts a DigiWallet fejlesztésében anonim adatok megosztásával";

/* Share data prompt title */
"Prompts.ShareData.title" = "Anonim adatok megosztása";

/* Enable touch ID prompt body */
"Prompts.TouchId.body" = "Bökj ide a Touch ID engedélyezéséhez";

/* Enable touch ID prompt title */
"Prompts.TouchId.title" = "Touch ID engedélyezése";

/* Upgrade PIN prompt body. */
"Prompts.UpgradePin.body" = "A DigiWallet 6 számjegyű PIN kóddal bővült. Bökj ide a frissítéshez.";

/* Upgrade PIN prompt title. */
"Prompts.UpgradePin.title" = "PIN kód frissítés";

/* Notifications will be added later but users can set their preferences now, which is why we specify "in the future". */
"PushNotifications.body" = "Kapcsold be az értesítéseket, hogy a jövőben speciális üzeneteket kaphass a DigiWallettől.";

/* Push notifications toggle switch label */
"PushNotifications.label" = "Értesítések";

/* Push notifications are off label */
"PushNotifications.off" = "Kikapcsolva";

/* Push notifications are on label */
"PushNotifications.on" = "Bekapcsolva";

/* Push notifications settings view title label */
"PushNotifications.title" = "Értesítések";

/* Address copied message. */
"Receive.copied" = "Vágólapra másolva.";

/* Share via email button label */
"Receive.emailButton" = "Email";

/* Request button label */
"Receive.request" = "Összeg kérése";

/* Share button label */
"Receive.share" = "Megosztás";

/* Share via text message (SMS) */
"Receive.textButton" = "Szöveges üzenet";

/* Receive modal title */
"Receive.title" = "Részesül";

/* Done button text */
"RecoverWallet.done" = "Kész";

/* Recover wallet header */
"RecoverWallet.header" = "Pénztárca visszaállítás";

/* Reset PIN with paper key: header */
"RecoverWallet.header_reset_pin" = "PIN kód visszaállítása";

/* Enter paper key instruction */
"RecoverWallet.instruction" = "Papír kulcs megadása";

/* Recover wallet intro */
"RecoverWallet.intro" = "DigiWallet visszaállítása papír kulcs segítségével.";

/* Invalid paper key message */
"RecoverWallet.invalid" = "A papír kulcs amit megadtál helytelen. Kérlek duplán ellenőrizz minden szót és próbáld újra.";

/* Previous button accessibility label */
"RecoverWallet.leftArrow" = "Bal Nyíl";

/* Next button label */
"RecoverWallet.next" = "Következő";

/* Reset PIN with paper key: more information button. */
"RecoverWallet.reset_pin_more_info" = "Bökj ide további információhoz.";

/* Next button accessibility label */
"RecoverWallet.rightArrow" = "Jobb Nyíl";

/* Recover wallet sub-header */
"RecoverWallet.subheader" = "Add meg a papír kulcsot ahhoz a pénztárcához amelyiket vissza szeretnéd állítani.";

/* Reset PIN with paper key: sub-header */
"RecoverWallet.subheader_reset_pin" = "PIN kód visszaállításához, add meg a szavakat a papír kulcsodról alul a dobozban.";

/* No amount entered error message. */
"RequestAnAmount.noAmount" = "Kérlek, először add meg az összeget.";

/* Request a specific amount of bitcoin */
"RequestAnAmount.title" = "Összeg kérése";

/* Alert action button label */
"ReScan.alertAction" = "Szinkronizál";

/* Alert message body */
"ReScan.alertMessage" = "Szinkronizálás közben nem tudsz pénzt küldeni.";

/* Alert message title */
"ReScan.alertTitle" = "Szinkronizálás a Blokklánccal?";

/* extimated time */
"ReScan.body1" = "20-45 perc";

/* Syncing explanation */
"ReScan.body2" = "Ha egy tranzakció befejezettnek látszik a DigiByte hálózaton, de nem látszik a DigiWalleten.";

/* Syncing explanation */
"ReScan.body3" = "Ismételt hibaüzenetet kapsz arra vonatkozóan, hogy tranzakciódat elutasították.";

/* Start Sync button label */
"ReScan.buttonTitle" = "Szinkronizálás indítása";

/* Sync blockchain view footer */
"ReScan.footer" = "Nem tudsz pénzt küldeni mialatt szinkronizálás van folyamatban a blokklánccal.";

/* Sync Blockchain view header */
"ReScan.header" = "Blokklánc szinkronizálás";

/* Subheader label */
"ReScan.subheader1" = "Becsült idő";

/* Subheader label */
"ReScan.subheader2" = "Mikor kell szinkronizálni?";

/* Scan bitcoin address camera flash toggle */
"Scanner.flashButtonLabel" = "Kamera vaku";

/* Complete filter label */
"Search.complete" = "teljes";

/* Pending filter label */
"Search.pending" = "függőben";

/* Received filter label */
"Search.received" = "beérkezett";

/* Sent filter label */
"Search.sent" = "küldött";

/* Face ID button title */
"SecurityCenter.faceIdTitle" = "Face ID";

/* Security Center Info */
"SecurityCenter.info" = "Összes biztonsági funkció engedélyezése a maximális védelem érdekében.";

/* Paper Key button description */
"SecurityCenter.paperKeyDescription" = "Az egyetlen mód a DigiByte-jaid hozzáféréséhez, ha elhagyod vagy frissíted a telefonod. ";

/* Paper Key button title */
"SecurityCenter.paperKeyTitle" = "Papír kulcs";

/* PIN button description */
"SecurityCenter.pinDescription" = "Védd meg DigiWalleted a jogosulatlan felhasználóktól.";

/* PIN button title */
"SecurityCenter.pinTitle" = "6 számjegyű PIN kód";

/* Security Center Title */
"SecurityCenter.title" = "Biztonsági Központ";

/* Touch ID button description */
"SecurityCenter.touchIdDescription" = "Kényelmesen hozzáférhetsz DigiWalletedhez és pénzt küldhetsz egy meghatározott határértékig.";

/* Touch ID button title */
"SecurityCenter.touchIdTitle" = "Touch ID";

/* Send money amount label */
"Send.amountLabel" = "Összeg";

/* Balance: $4.00 */
"Send.balance" = "Egyenleg: %1$@";

/* Camera not allowed message */
"Send.cameraunavailableMessage" = "Menj a Beállításokba a kamera engedélyezéséhez.";

/* Camera not allowed alert title */
"Send.cameraUnavailableTitle" = "DigiWalletnek nincs engedélye a kamera használatához";

/* Warning when sending to self. */
"Send.containsAddress" = "A cél cím a saját címed. Nem küldhetsz saját magadnak.";

/* Could not create transaction alert title */
"Send.creatTransactionError" = "Tranzakció létrehozása sikertelen.";

/* Description for sending money label */
"Send.descriptionLabel" = "Emlékeztető";

/* Emtpy pasteboard error message */
"Send.emptyPasteboard" = "Az űrlap üres";

/* Network Fee: $0.01 */
"Send.fee" = "Hálózati költség: %1$@";

/* Payee identity not certified alert title. */
"Send.identityNotCertified" = "A kedvezményezett személyazonossága nincs igazolva.";

/* Invalid address alert message */
"Send.invalidAddressMessage" = "A cél cím nem érvényes DigiByte cím.";

/* Invalid address on pasteboard message */
"Send.invalidAddressOnPasteboard" = "Az űrlap nem tartalmaz érvényes DigiByte címet.";

/* Invalid address alert title */
"Send.invalidAddressTitle" = "Érvénytelen cím";

/* Is rescanning error message */
"Send.isRescanning" = "A küldés letiltva a teljes újraolvasás alatt.";

/* Loading request activity view message */
"Send.loadingRequest" = "Kérés betöltése";

/* Empty address alert message */
"Send.noAddress" = "Kérlek, add meg a címzett címét.";

/* Emtpy amount alert message */
"Send.noAmount" = "Kérlek add meg az elküldeni kívánt összeget.";

/* Paste button label */
"Send.pasteLabel" = "Beillesztés";

/* Could not publish transaction alert title */
"Send.publishTransactionError" = "Nem sikerült közzétenni a tranzakciót.";

/* Could not load remote request error message */
"Send.remoteRequestError" = "Nem sikerült betölteni a fizetési kérelmet";

/* Scan button label */
"Send.scanLabel" = "Beolvas";

/* Send button label (the action, "press here to send") */
"Send.sendLabel" = "Küldés";

/* Send screen title (as in "this is the screen for sending money") */
"Send.title" = "Küldés";

/* Send money to label */
"Send.toLabel" = "számára";

/* Adress already used alert message - first part */
"Send.UsedAddress.firstLine" = "A DigiByte címek csak egyszer használhatóak.";

/* Adress already used alert message - second part */
"Send.UsedAddress.secondLIne" = "Az újrafelhasználás csökkenti az adatvédelmet a címzett és saját magad számára ami veszteséget okozhat, ha a címzett nem közvetlenül felügyeli a címet.";

/* Adress already used alert title */
"Send.UsedAddress.title" = "A cím már használva volt";

/* About label */
"Settings.about" = "Névjegy";

/* Advanced Settings title */
"Settings.advancedTitle" = "További Beállítások";

/* i.e. the currency which will be displayed */
"Settings.currency" = "Megjelenítendő valuta";

/* Join Early access label */
"Settings.earlyAccess" = "Csatlakozz a korai hozzáféréshez";

/* Are you enjoying bread alert message body */
"Settings.enjoying" = "Szereted a DigiWalletet?";

/* Face ID spending limit label */
"Settings.faceIdLimit" = "Face ID költési limit";

/* Import wallet label */
"Settings.importTitle" = "Pénztárca importálás";

/* Manage settings section header */
"Settings.manage" = "Kezelő";

/* Notifications label */
"Settings.notifications" = "Értesítések";

/* Leave review button label */
"Settings.review" = "Véleményezz";

/* Share anonymous data label */
"Settings.shareData" = "Anonim adatok megosztása";

/* Sync blockchain label */
"Settings.sync" = "Blokklánc szinkronizálás";

/* Settings title */
"Settings.title" = "Beállítások";

/* Touch ID spending limit label */
"Settings.touchIdLimit" = "Touch ID költési limit";

/* Wallet Settings section header */
"Settings.wallet" = "Pénztárca";

/* Start or recover another wallet menu label. */
"Settings.wipe" = "Másik pénztárca indítás/visszaállítás";

/* Share data view body */
"ShareData.body" = "Segíts a DigiWallet fejlesztésében anonim adatok megosztásával a fejlesztők részére. Nem tartalmaz pénzügyi információkat. Tiszteletben tartjuk a pénzügyi magánéleted.";

/* Share data header */
"ShareData.header" = "Adatok megosztása?";

/* Share data switch label. */
"ShareData.toggleLabel" = "Anonim adatok megosztása?";

/* button label */
"StartPaperPhrase.againButtonTitle" = "Írd le a papír kulcsot újra";

/* Paper key explanation text. */
"StartPaperPhrase.body" = "A papír kulcs az egyetlen mód arra hogy visszaállítsd DigiWalleted ha a telefonod elhagyod, ellopják, megsérül vagy frissíted.\n\nMutatunk neked egy listát szavakkal, amiket írj le egy papírra és helyezd biztonságba.";

/* button label */
"StartPaperPhrase.buttonTitle" = "Írd le a papír kulcsot";

/* Argument is date */
"StartPaperPhrase.date" = "Utoljára ekkor írtad le a papír kulcsod: %1$@";

/* Start view message */
"StartViewController.message" = "A legbiztonságosabb mód a DigiByte használatára.";

/* Syncing view connectiong state header text */
"SyncingView.connecting" = "Kapcsolódás";

/* Syncing view header text */
"SyncingView.header" = "Szinkronizálás";

/* Retry button label */
"SyncingView.retry" = "Újra";

/* Syncing view syncing state header text */
"SyncingView.syncing" = "Szinkronizálás";

/* 6 d (6 days) */
"TimeSince.days" = "%1$@ nap";

/* 6 h (6 hours) */
"TimeSince.hours" = "%1$@ ó";

/* 6 m (6 minutes) */
"TimeSince.minutes" = "%1$@ p";

/* 6 s (6 seconds) */
"TimeSince.seconds" = "%1$@ másodperc";

/* You can customize your Touch ID Spending Limit from the [TouchIdSettings.linkText gets added here as a button] */
"TouchIdSettings.customizeText" = "Testreszabhatod a Touch ID költési limited innen: %1$@.";

/* Touch Id screen label */
"TouchIdSettings.label" = "Használd az ujjlenyomatod DigiWalleted hozzáféréséhez és küldj pénzt egy meghatározott határértékig.";

/* Link Text (see TouchIdSettings.customizeText) */
"TouchIdSettings.linkText" = "Touch ID költési limit képernyő";

/* Spending Limit: b100,000 ($100) */
"TouchIdSettings.spendingLimit" = "Költési limit: %1$@ (%2$@)";

/* Touch id switch label. */
"TouchIdSettings.switchLabel" = "Touch ID engedélyezése a DigiWallet számára";

/* Touch ID settings view title */
"TouchIdSettings.title" = "Touch ID";

/* Touch ID unavailable alert message */
"TouchIdSettings.unavailableAlertMessage" = "Nincs beállított Touch ID ezen az eszközön. Menj a Beállítások -> Touch ID és jelszavak lehetőséghez és állítsd be most.";

/* Touch ID unavailable alert title */
"TouchIdSettings.unavailableAlertTitle" = "Touch ID nincs beállítva";

/* Always require passcode option */
"TouchIdSpendingLimit" = "Jelszó mindig szükséges";

/* Touch ID spending limit screen body */
"TouchIdSpendingLimit.body" = "Küldési limit felett, minden esetben szükség van a 6 számjegyű PIN kód megadására és a legutóbbi 6 számjegyű PIN-kód megadásától számított 48 órán belül.";

/* Touch Id spending limit screen title */
"TouchIdSpendingLimit.title" = "Touch ID küldési limit";

/* Availability status text */
"Transaction.available" = "Elérhető";

/* Transaction complete label */
"Transaction.complete" = "Teljesítés";

/* eg. Ending balance: $50.00 */
"Transaction.ending" = "Záró egyenleg: %1$@";

/* Exchange rate on date header */
"Transaction.exchangeOnDayReceived" = "Árfolyam beérkezéskor:";

/* Exchange rate on date header */
"Transaction.exchangeOnDaySent" = "Árfolyam küldéskor";

/* (b600 fee) */
"Transaction.fee" = "(%1$@ költség)";

/* Invalid transaction */
"Transaction.invalid" = "ÉRVÉNYTELEN";

/* Timestamp label for event that just happened */
"Transaction.justNow" = "éppen most";

/* Receive status text: 'In progress: 20%' */
"Transaction.receivedStatus" = "Folyamatban: %1$@";

/* Send status text: 'In progress: 20%' */
"Transaction.sendingStatus" = "Folyamatban: %1$@";

/* eg. Starting balance: $50.00 */
"Transaction.starting" = "Kezdő egyenleg: %1$@";

/* Waiting to be confirmed string */
"Transaction.waiting" = "Várakozás a megerősítésre. Egyes kereskedők megerősítést kérnek a tranzakció befejezéséhez. Becsült idő: 1-2 perc.";

/* e.g. I received money from an account. */
"TransactionDetails.account" = "számla";

/* Amount section header */
"TransactionDetails.amountHeader" = "Összeg";

/* Block height label */
"TransactionDetails.blockHeightLabel" = "Megerősítve Blokkban";

/* Memo section header */
"TransactionDetails.commentsHeader" = "Emlékeztető";

/* Empty transaction list message. */
"TransactionDetails.emptyMessage" = "Tranzakcióid itt jelennek meg.";

/* "Received [$5] at [which of my addresses]" => This is the "at [which of my addresses]" part. */
"TransactionDetails.from" = "%1$@ címre";

/* More button title */
"TransactionDetails.more" = "Több...";

/* Moved $5.00 (as in "I moved $5 to another location") */
"TransactionDetails.moved" = "Áthelyezve %1$@";

/* Moved $5.00 */
"TransactionDetails.movedAmountDescription" = "Áthelyezve <b>%1@</b>";

/* eg. Confirmed in Block: Not Confirmed */
"TransactionDetails.notConfirmedBlockHeightLabel" = "Nem megerősített";

/* "Received [$5] at [which of my addresses]" => This is the "Received [$5]" part. */
"TransactionDetails.received" = "Beérkezett %1$@";

/* Received $5.00 */
"TransactionDetails.receivedAmountDescription" = "Beérkezett <b>%1@</b>";

/* "Sent [$5] to [address]" => This is the "Sent [$5]" part. */
"TransactionDetails.sent" = "Elküldve %1$@";

/* Sent $5.00 */
"TransactionDetails.sentAmountDescription" = "Elküldve <b>%1@</b>";

/* Status section header */
"TransactionDetails.statusHeader" = "Állapot";

/* Transaction Details Title */
"TransactionDetails.title" = "Tranzakció részletei";

/* "Sent [$5] to [address]" => This is the "to [address]" part. */
"TransactionDetails.to" = "%1$@ számára";

/* Transaction ID header */
"TransactionDetails.txHashHeader" = "DigiByte Tranzakciós ID";

/* (this transaction was) Received at this address: */
"TransactionDirection.address" = "Erre a címre érkezett";

/* (this transaction was) Sent to this address: */
"TransactionDirection.to" = "Elküldve erre a címre";

/* Disabled until date */
"UnlockScreen.disabled" = "Letiltva eddig: %1$@";

/* My Address button title */
"UnlockScreen.myAddress" = "Saját címem";

/* Reset PIN with Paper Key button label. */
"UnlockScreen.resetPin" = "PIN kód visszaállítása";

/* Scan button title */
"UnlockScreen.scan" = "Beolvas";

/* Unlock Screen sub-header */
"UnlockScreen.subheader" = "PIN kód megadása";

/* TouchID prompt text */
"UnlockScreen.touchIdPrompt" = "DigiWallet feloldása.";

/* Unlock with TouchID accessibility label */
"UnlockScreen.touchIdText" = "Feloldás TouchID-vel";

/* Wallet unlocked message */
"UnlockScreen.unlocked" = "Pénztárca feloldva";

/* Update PIN caption text */
"UpdatePin.caption" = "Emlékezz erre a PIN kódra. Ha elfelejted, nem tudsz többé hozzáférni a DigiByte-jaidhoz.";

/* PIN creation info. */
"UpdatePin.createInstruction" = "A PIN kódod a DigiWalleted feloldásához és pénz küldéséhez használhatod.";

/* Update PIN title */
"UpdatePin.createTitle" = "PIN kód beállítás";

/* Update PIN title */
"UpdatePin.createTitleConfirm" = "PIN kód újbóli megadása";

/* Enter current PIN instruction */
"UpdatePin.enterCurrent" = "Add meg a jelenlegi PIN kódodat";

/* Enter new PIN instruction */
"UpdatePin.enterNew" = "Add meg az új PIN kódodat.";

/* Re-Enter new PIN instruction */
"UpdatePin.reEnterNew" = "Új PIN kód megadása még egyszer";

/* Update PIN failure error message. */
"UpdatePin.setPinError" = "Sajnáljuk, a PIN kódot nem lehet frissíteni.";

/* Update PIN failure alert view title */
"UpdatePin.setPinErrorTitle" = "PIN kód frissítési hiba";

/* Update PIN title */
"UpdatePin.updateTitle" = "PIN kód frissítése";

/* Authorize to copy wallet addresses alert message */
"URLHandling.addressaddressListAlertMessage" = "Pénztárca címek másolása a vágólapra?";

/* Authorize to copy wallet address PIN view prompt. */
"URLHandling.addressList" = "Engedélyezd a pénztárca cím másolását a vágólapra";

/* Authorize to copy wallet address alert title */
"URLHandling.addressListAlertTitle" = "Pénztárca címek másolása";

/* Copy wallet addresses alert button label */
"URLHandling.copy" = "Másol";

/* Verify PIN for transaction view body */
"VerifyPin.authorize" = "Add meg a PIN kódod a tranzakció engedélyezéséhez.";

/* Verify PIN view body */
"VerifyPin.continueBody" = "Add meg a PIN kódod a folytatáshoz.";

/* Verify PIN view title */
"VerifyPin.title" = "PIN kód szükséges";

/* Authorize transaction with touch id message */
"VerifyPin.touchIdMessage" = "Engedélyezd a tranzakciót";

/* 'No wallet' warning for watch app */
"Watch.noWalletWarning" = "Nyisd meg a DigiWallet iPhone applikációját a pénztárcád beállításához.";

/* Dismiss button label */
"Webview.dismiss" = "Elutasít";

/* Webview loading error message */
"Webview.errorMessage" = "Hiba történt a tartalom betöltése közben. Kérlek próbáld újra.";

/* Updating webview message */
"Webview.updating" = "Frissítés...";

/* Welcome screen text. (?) will be replaced with the help icon users should look for. */
"Welcome.body" = "A DigiByte of iOS, új neve: DigiWallet, új megjelenéssel és új funkciókkal.\n\nHa segítségre van szükséged, keresd fent a sarokban található (?) elemet.";

/* Top title of welcome screen */
"Welcome.title" = "Üdvözöl a DigiWallet!";

/* Wipe wallet alert message */
"WipeWallet.alertMessage" = "Biztos vagy benne hogy törölni akarod ezt a pénztárcát?";

/* Wipe wallet alert title */
"WipeWallet.alertTitle" = "Pénztárca törlése?";

/* Failed wipe wallet alert message */
"WipeWallet.failedMessage" = "Nem sikerült a pénztárca törlése";

/* Failed wipe wallet alert title */
"WipeWallet.failedTitle" = "Sikertelen";

/* Enter phrase to wipe wallet instruction. */
"WipeWallet.instruction" = "Add meg ennek a pénztárcának a visszaállítási kifejezéseit a törléshez és indíts vagy állíts vissza egy másikat. Jelenlegi egyenleged ezen a kifejezésen marad.";

/* Start wipe wallet view message */
"WipeWallet.startMessage" = "Másik pénztárca indítása vagy visszaállítása lehetőséget ad különböző DigiWallet pénztárcák kezelésére.";

/* Start wipe wallet view warning */
"WipeWallet.startWarning" = "Továbbá nem tudsz hozzáférni a jelenlegi DigiWalletedhez erről az eszközről. A az egyenleg a kifejezésen marad.";

/* Wipe wallet navigation item title. */
"WipeWallet.title" = "Másik pénztárca indítása vagy visszaállítása";

/* Wipe wallet button title */
"WipeWallet.wipe" = "Törlés";

/* Wiping activity message */
"WipeWallet.wiping" = "Törlés...";

/* Paper key instructions. */
"WritePaperPhrase.instruction" = "Írj le sorrendben minden egyes szót és tárold egy biztonságos helyen.";

/* button label */
"WritePaperPhrase.next" = "Következő";

/* button label */
"WritePaperPhrase.previous" = "Előző";

/* 1 of 3 */
"WritePaperPhrase.step" = "%1$d / %2$d";

